{
  "lightning": [
    {
      "title": "Downsampling Time Series Data for Visualizations",
      "authors": [
        {
          "name": "Delaina Moore",
          "affiliation": "Chevron",
          "orcid": ""
        }
      ],
      "description": "Exploring the largest triangle three bucket algorithm to downsample time series data.",
      "zenodo_url": "https://zenodo.org/record/6946652",
      "slide_id": "Delaina M Triangles",
      "doi": "10.25080/majora-212e5952-027"
    },
    {
      "title": "Analysis as Applications: Quick introduction to lockfiles",
      "authors": [
        {
          "name": "Matthew Feickert",
          "affiliation": "University of Wisconsin-Madison",
          "orcid": "0000-0003-4124-7862"
        }
      ],
      "description": "An opinionated argument for the use of lockfiles in scientific analysis in a similar manner to Python application deployment. This talk was inspired by Brett Cannon's 'pip-secure-install' project and a Twitter conversation with Dustin Ingram on April 20, 2020.",
      "zenodo_url": "https://zenodo.org/record/6946666",
      "slide_id": "feickert-analysis-as-applications",
      "doi": "10.25080/majora-212e5952-028"
    }
  ],
  "posters": [
    {
      "title": "Optimal Review Assignments for the SciPy Conference Using Binary Integer Linear Programming in SciPy 1.9",
      "authors": [
        {
          "name": "Matt Haberland",
          "affiliation": "California Polytechnic State University, San Luis Obispo",
          "orcid": "0000-0003-4806-3601"
        },
        {
          "name": "Nicholas McKibben",
          "affiliation": "Skayl, LLC",
          "orcid": "0000-0003-0034-2230"
        }
      ],
      "description": "Each year, the SciPy Conference receives hundreds of submissions, and dozens of volunteers offer to review them to help make selections for the conference. How should submissions be assigned to reviewers to distribute the work fairly while 1) ensuring that each submission receives at least three reviews, 2) preventing conflicts of interest, and 3) respecting reviewers' domains of expertise? Binary integer linear programming is an ideal framework for defining and solving 'scheduling' or 'assignment' problems like this. In this poster, we show how users can formulate and solve problems of this type with new, accessible tools in the scientific Python ecosystem.",
      "zenodo_url": "https://zenodo.org/record/6946674",
      "slide_id": "125_haberland",
      "doi": "10.25080/majora-212e5952-029"
    },
    {
      "title": "Contributing to Open Source Software: From not knowing Python to becoming a Spyder core developer",
      "authors": [
        {
          "name": "Daniel Althviz Moré",
          "affiliation": "Quansight",
          "orcid": "0000-0003-1759-4194"
        }
      ],
      "description": "Experience overview of becoming an open source developer and updates on the work being done in the Spyder IDE project for 2022",
      "zenodo_url": "https://zenodo.org/record/6946686",
      "slide_id": "155_althviz",
      "doi": "10.25080/majora-212e5952-02a"
    },
    {
      "authors": [
        {
          "name": "Nathan Jessurun",
          "affiliation": "University of Florida"
        },
        {
          "name": "Olivia P. Dizon-Paradis",
          "affiliation": "University of Florida"
        },
        {
          "name": "Dan E. Capecci",
          "affiliation": "University of Florida"
        },
        {
          "name": "Damon L. Woodard",
          "affiliation": "University of Florida"
        },
        {
          "name": "Navid Asadizanjani",
          "affiliation": "University of Florida"
        }
      ],
      "title": "Semi-Supervised Semantic Annotator (S3A): Toward Efficient Semantic Image Labeling",
      "description": "Python GUI and library for semantic image segmentation and annotation",
      "zenodo_url": "https://zenodo.org/record/6946702",
      "slide_id": "221_jessurun",
      "doi": "10.25080/majora-212e5952-02b"
    },
    {
      "title": "Bioframe: Operating on Genomic Interval Dataframes",
      "authors": [
        {
          "name": "Nezar Abdennur",
          "affiliation": "University of Massachusetts Chan Medical School",
          "orcid": "0000-0001-5814-0864"
        },
        {
          "name": "Geoffrey Fudenberg",
          "affiliation": "University of Southern California",
          "orcid": "0000-0001-5905-6517"
        },
        {
          "name": "Ilya M. Flyamer",
          "affiliation": "Friedrich Miescher Institute for Biomedical Research",
          "orcid": "0000-0002-4892-4208"
        },
        {
          "name": "Aleksandra Galitsyna",
          "affiliation": "Massachusetts Institute of Technology",
          "orcid": "0000-0001-8969-5694"
        },
        {
          "name": "Anton Goloborodko",
          "affiliation": "Institute of Molecular Biotechnology of the Austrian Academy of Sciences",
          "orcid": "0000-0002-2210-8616"
        },
        {
          "name": "Maxim Imakaev",
          "affiliation": "Massachusetts Institute of Technology",
          "orcid": "0000-0002-5320-2728"
        },
        {
          "name": "Trevor Manz",
          "affiliation": "Harvard Medical School",
          "orcid": "0000-0001-7694-5164"
        },
        {
          "name": "Sergey V. Venev",
          "affiliation": "University of Massachusetts Chan Medical School",
          "orcid": "0000-0002-1507-7460"
        }
      ],
      "description": "Python library for working with genomic interval dataframes.",
      "zenodo_url": "https://zenodo.org/record/6946712",
      "slide_id": "bioframe",
      "doi": "10.25080/majora-212e5952-02c"
    },
    {
      "authors": [
        {
          "name": "Joseph V. Tuccillo",
          "affiliation": "Oak Ridge National Laboratory",
          "orcid": "0000-0002-5930-0943"
        },
        {
          "name": "James D. Gaboardi",
          "affiliation": "Oak Ridge National Laboratory",
          "orcid": "0000-0002-4776-6826"
        }
      ],
      "title": "Likeness: a toolkit for connecting the social fabric of place to human dynamics",
      "description": "Richly-attributed synthetic population data are crucial for discerning human dynamics while preserving privacy. The Likeness toolkit provides a solution to this problem with a suite of Python packages that generate population data as individual agents in appropriate nighttime locations and allocates them to probable daytime activity spaces. Through a case study utilizing students and faculty as agents, the results of Likeness simulations are shown to recreate high-fidelity school capacities, comparable to empirical data sources.",
      "zenodo_url": "https://zenodo.org/record/6946720",
      "slide_id": "james_gaboardi",
      "doi": "10.25080/majora-212e5952-02d"
    },
    {
      "authors": [
        {
          "name": "Jyotika Singh",
          "affiliation": "Placemakr",
          "orcid": "0000-0002-5442-3004"
        }
      ],
      "title": "pyAudioProcessing: Audio Processing, Feature Extraction, and Machine Learning Modeling",
      "description": "pyAudioProcessing is a Python based library for processing audio data, constructing and extracting numerical features from audio, building and testing machine learning models, and classifying data with existing pre-trained audio classification models or custom user-built models. This library contains features built in Python that were originally published in MATLAB. pyAudioProcessing allows the user to compute various features from audio files including Gammatone Frequency Cepstral Coefficients (GFCC), Mel Frequency Cepstral Coefficients (MFCC), spectral features, chroma features, and others such as beat-based and cepstrum-based features from audio. One can use these features along with one’s own classification backend or any of the popular scikit-learn classifiers that have been integrated into pyAudioProcessing. Cleaning functions to strip unwanted portions from the audio are another offering of the library. It further contains integrations with other audio functionalities such as frequency and time-series visualizations and audio format conversions. This software aims to provide machine learning engineers, data scientists, researchers, and students with a set of baseline models to classify audio. The library is available at https://github.com/jsingh811/pyAudioProcessing and is under GPL-3.0 license.",
      "zenodo_url": "https://zenodo.org/record/6946724",
      "slide_id": "jyotika_singh",
      "doi": "10.25080/majora-212e5952-02e"
    },
    {
      "authors": [
        {
          "name": "Neelima Pulagam",
          "affiliation": "Ford Motor Company",
          "orcid": "0000-0002-4584-9513"
        },
        {
          "name": "Sai Marasani",
          "affiliation": "Ford Motor Company",
          "orcid": "0000-0002-8211-7186"
        },
        {
          "name": "Brian Sass",
          "affiliation": "Ford Motor Company"
        }
      ],
      "title": "Kiwi: Python Tool for Tex Processing and Classification",
      "description": "A user-friendly desktop tool for text visualization and classification. This allows users within the field to avoid creating boilerplate code for basic NLP tasks and users new to machine learning to plug and play with various models and methods. Our main goal is to make natural language processing accessible and easy.",
      "zenodo_url": "https://zenodo.org/record/6946734",
      "slide_id": "kiwi_tool",
      "doi": "10.25080/majora-212e5952-02f"
    },
    {
      "authors": [
        {
          "name": "Wanlin Li",
          "affiliation": "Department of Computer Science, University of Sherbrooke, Sherbrooke, QC J1K2R1, Canada"
        },
        {
          "name": "Aleksandr Koshkarov",
          "affiliation": "Department of Computer Science, University of Sherbrooke, Sherbrooke, QC J1K2R1, Canada"
        },
        {
          "name": "My-Linh Luu",
          "affiliation": "Department of Computer Science, University of Quebec at Montreal, Montreal, QC, Canada"
        },
        {
          "name": "Nadia Tahiri",
          "affiliation": "Department of Computer Science, University of Sherbrooke, Sherbrooke, QC J1K2R1, Canada"
        }
      ],
      "title": "Phylogeography: Analysis of genetic and climatic data of SARS-CoV-2",
      "description": "Due to the fact that the SARS-CoV-2 pandemic reaches its peak, researchers around the globe are combining efforts to investigate the genetics of different variants to better deal with its distribution. This paper discusses phylogeographic approaches to examine how patterns of divergence within SARS-CoV-2 coincide with geographic features, such as climatic features. First, we propose a python-based bioinformatic pipeline called **aPhylogeo** for phylogeographic analysis written in Python 3 that help researchers better understand the distribution of the virus in specific regions via a configuration file, and then run all the analysis operations in a single run. In particular, the aPhylogeo tool determines which parts of the genetic sequence undergo a high mutation rate depending on geographic conditions, using a sliding window that moves along the genetic sequence alignment in user-defined steps and a window size. As a Python-based cross-platform program, aPhylogeo works on Windows®, MacOS X® and GNU/Linux. The implementation of this pipeline is publicly available on GitHub (https://github.com/tahiri-lab/aPhylogeo). Second, we present an example of analysis of our new aPhylogeo tool on real data (SARS-CoV-2) to understand the occurrence of different variants.",
      "zenodo_url": "https://zenodo.org/record/6946742",
      "slide_id": "nadia_tahiri",
      "doi": "10.25080/majora-212e5952-030"
    },
    {
      "authors": [
        {
          "name": "Nathan Martindale",
          "affiliation": "Oak Ridge National Laboratory",
          "orcid": "0000-0002-5036-5433"
        },
        {
          "name": "Jason Hite",
          "affiliation": "Oak Ridge National Laboratory",
          "orcid": "0000-0001-8931-5815"
        },
        {
          "name": "Scott Stewart",
          "affiliation": "Oak Ridge National Laboratory",
          "orcid": "0000-0003-4320-5818"
        },
        {
          "name": "Mark Adams",
          "affiliation": "Oak Ridge National Laboratory",
          "orcid": "0000-0002-5414-2800"
        }
      ],
      "title": "Design of a Scientific Data Analysis Support Platform",
      "description": "Studying the design features necessary for a workflow and experiment management system, and presenting Curifactory: an open source package that meets these design features.",
      "zenodo_url": "https://zenodo.org/record/6946750",
      "slide_id": "nathan_martindale",
      "doi": "10.25080/majora-212e5952-031"
    },
    {
      "authors": [
        {
          "name": "Zachary Sherman",
          "affiliation": "Argonne National Laboratory",
          "orcid": "0000-0002-6455-8324"
        },
        {
          "name": "Scott Collis",
          "affiliation": "Argonne National Laboratory",
          "orcid": "0000-0002-2303-687X"
        },
        {
          "name": "Max Grover",
          "affiliation": "Argonne National Laboratory",
          "orcid": "0000-0002-0370-8974"
        },
        {
          "name": "Robert Jackson",
          "affiliation": "Argonne National Laboratory",
          "orcid": "0000-0003-2518-1234"
        },
        {
          "name": "Adam Theisen",
          "affiliation": "Argonne National Laboratory",
          "orcid": "0000-0002-7602-1057"
        }
      ],
      "title": "Opening ARM: A pivot to community software to meet the needs of users and stakeholders of the planet's largest cloud observatory",
      "description": "This presentation discusses the evolution (and hurdles that came with) of the Atmospheric Radiation Measurement (ARM) program's open source endeavors, starting with the Python ARM Radar Toolkit to the Atmospheric data Community Toolkit in 2018, the expansion of our open-source presence on Github in 2019 and what is planned for the future.",
      "zenodo_url": "https://zenodo.org/record/6946754",
      "slide_id": "opening_arm",
      "doi": "10.25080/majora-212e5952-032"
    }
  ],
  "slides": [
    {
      "title": "Building Binary Extensions with pybind11, scikit-build, and cibuildwheel",
      "authors": [
        {
          "name": "Henry Schreiner",
          "affiliation": "Princeton University",
          "orcid": "0000-0002-7833-783X"
        },
        {
          "name": "Joe Rickerby",
          "affiliation": "Nord Projects"
        },
        {
          "name": "Ralf Grosse-Kunstleve",
          "affiliation": "Google"
        },
        {
          "name": "Wenzel Jakob",
          "affiliation": "Ecole Polytechnique Fédérale de Lausanne",
          "orcid": "0000-0002-6090-1121"
        },
        {
          "name": "Matthieu Darbois",
          "affiliation": "PyPA"
        },
        {
          "name": "Aaron Gokaslan",
          "affiliation": "Facebook Research"
        },
        {
          "name": "Jean-Christophe Fillion-Robin",
          "affiliation": "Kitware",
          "orcid": "0000-0002-9688-8950"
        },
        {
          "name": "Matt McCormick",
          "affiliation": "Kitware",
          "orcid": "0000-0001-9475-3756"
        }
      ],
      "description": "Building binary extensions is easier than ever thanks to several key libraries. Pybind11 provides a natural C++ language for extensions without requiring pre-processing or special dependencies. Scikit-build ties the premier C++ build system, CMake, into the Python extension build process. And cibuildwheel makes it easy to build highly compatible wheels for over 80 different platforms using CI or on your local machine.",
      "zenodo_url": "https://zenodo.org/record/6946769",
      "slide_id": "BuildingBinaryExtensions_HenrySchreiner",
      "doi": "10.25080/majora-212e5952-033"
    },
    {
      "title": "Python Development Schemes for Monte Carlo Neutronics on High Performance Computing",
      "authors": [
        {
          "name": "Jackson P. Morgan",
          "affiliation": "Oregon State University",
          "orcid": "0000-0003-1379-5431"
        },
        {
          "name": "Kyle E. Niemeyer",
          "affiliation": "Oregon State University",
          "orcid": "0000-0003-4425-7097"
        }
      ],
      "description": "We investigate three methods of hardware accleeration on both GPUs and CPUs for a Monte Carlo neutron transport simulation code writen in Python. The accelerating schemes we examine are Pykokks, Numba, and hardware code generating libraries like PyCUDA. This work was supported by the Center for Exascale Monte-Carlo Neutron Transport (CEMeNT) a PSAAP-III project funded by the Department of Energy, grant number: DE-NA003967.",
      "zenodo_url": "https://zenodo.org/record/6946791",
      "slide_id": "MCNeutronTransport_JacksonMorgan",
      "doi": "10.25080/majora-212e5952-034"
    },
    {
      "title": "Awkward Packaging: Building scikit-HEP",
      "authors": [
        {
          "name": "Henry Schreiner",
          "affiliation": "Princeton University",
          "orcid": "0000-0002-7833-783X"
        },
        {
          "name": "Jim Pivarski",
          "affiliation": "Princeton University",
          "orcid": "0000-0002-6649-343X"
        },
        {
          "name": "Eduardo Rodrigues",
          "affiliation": "University of Liverpool",
          "orcid": "0000-0003-2846-7625"
        }
      ],
      "description": "Scikit-HEP has grown rapidly over the last few years, not just to serve the needs of the High Energy Physics (HEP) community, but in many ways, the Python ecosystem at large. AwkwardArray, boost-histogram/hist, and iMinuit are examples of libraries that are used beyond the original HEP focus.",
      "zenodo_url": "https://zenodo.org/record/6946801",
      "slide_id": "ScikitHEP_HenrySchreiner",
      "doi": "10.25080/majora-212e5952-035"
    },
    {
      "title": "Development of Accessible, Aesthetically-Pleasing Color Sequences",
      "authors": [
        {
          "name": "Matthew A. Petroff",
          "affiliation": "Center for Astrophysics, Harvard & Smithsonian",
          "orcid": "0000-0002-4436-4215"
        }
      ],
      "description": "Many types of data visualization, e.g., line plots and scatter plots, utilize a discrete palette of colors, a color sequence, to differentiate between the categories of data being plotted. Unfortunately, many commonly-used color sequences offer poor accessibility to individuals with color-vision deficiencies, using colors that such individuals find difficult to differentiate between. Here, the development of new, accessible color sequences is discussed. As new color sequences must be aesthetically pleasing if they are to see widespread adoption, a crowd-sourced survey was used to estimate aesthetic preference, while accessibility aspects were handled via quantitative analysis.",
      "zenodo_url": "https://zenodo.org/record/6946815",
      "slide_id": "accessible-color-sequences",
      "doi": "10.25080/majora-212e5952-036"
    },
    {
      "title": "Cutting Edge Climate Science in the Cloud with Pangeo",
      "authors": [
        {
          "name": "Julius Busecke",
          "affiliation": "Columbia University",
          "orcid": "0000-0001-8571-865X"
        }
      ],
      "description": "Climate change is one of the most challenging issues of our time. To prevent the worst outcomes, we need to drastically accelerate the creation and distribution of scientific knowledge. But the complex and massive datasets produced by numerical climate models render the common 'download and analyze' workflow inefficient, blocking innovative analysis and fast scientific discoveries. We present python tools and cloud infrastructure developed within the Pangeo community, enabling cutting edge climate science from a web-browser, making it efficient, reproducible, and inclusive. To demonstrate these capabilities we will reproduce a plot from the IPCC report in a live cloud demonstration.",
      "zenodo_url": "https://zenodo.org/record/6946825",
      "slide_id": "busecke",
      "doi": "10.25080/majora-212e5952-037"
    },
    {
      "title": "Pylira: deconvolution of images in the presence of Poisson noise",
      "authors": [
        {
          "name": "Axel Donath",
          "affiliation": "Center for Astrophysics | Harvard & Smithsonian",
          "orcid": "0000-0003-4568-7005"
        },
        {
          "name": "Aneta Siemiginowska",
          "affiliation": "Center for Astrophysics | Harvard & Smithsonian",
          "orcid": "0000-0002-0905-7375"
        },
        {
          "name": "Vinay Kashyap",
          "affiliation": "Center for Astrophysics | Harvard & Smithsonian",
          "orcid": "0000-0002-3869-7996"
        },
        {
          "name": "Douglas Burke",
          "affiliation": "Center for Astrophysics | Harvard & Smithsonian",
          "orcid": ""
        },
        {
          "name": "Karthik Reddy Solipuram",
          "affiliation": "University of Maryland Baltimore County",
          "orcid": ""
        },
        {
          "name": "David van Dyk",
          "affiliation": "Imperial College London",
          "orcid": ""
        }
      ],
      "description": "Pylira is Python package for deconvolution for images in the presence of Poisson noise. In this presentation I will explain the method in detail, show the setup and API of the Python package as well as show application examples using real astronomical data.",
      "zenodo_url": "https://zenodo.org/record/6946829",
      "slide_id": "donath",
      "doi": "10.25080/majora-212e5952-038"
    },
    {
      "title": "Accelerating Science with the Generative Toolkit for Scientific Discovery (GT4SD)",
      "authors": [
        {
          "name": "GT4SD team",
          "affiliation": "",
          "orcid": ""
        }
      ],
      "description": "A presentation about GT4SD: an open-source platform to accelerate hypothesis generation in the scientific discovery process. It provides a library for making state-of-the-art generative AI models easier to use.",
      "zenodo_url": "https://zenodo.org/record/6946845",
      "slide_id": "gt4sd",
      "doi": "10.25080/majora-212e5952-039"
    },
    {
      "title": "MModel: a modular modeling framework for scientific prototyping",
      "authors": [
        {
          "name": "Peter Sun",
          "affiliation": "Cornell University",
          "orcid": ""
        },
        {
          "name": "John A. Marohn",
          "affiliation": "Cornell University",
          "orcid": ""
        }
      ],
      "description": "MModel is a Python framework that allows for fast and modular prototyping. The library uses networkx graph for workflow construction and provides built-in toolkits such as subgraph modification and graph visualization with rich metadata.",
      "zenodo_url": "https://zenodo.org/record/6946850",
      "slide_id": "mmodel",
      "doi": "10.25080/majora-212e5952-03a"
    },
    {
      "title": "Monaco: Quantify Uncertainty and Sensitivities in Your Computational Models with a Monte Carlo Library",
      "authors": [
        {
          "name": "W. Scott Shambaugh",
          "affiliation": "Capella Space",
          "orcid": "0000-0002-4376-3599"
        }
      ],
      "description": "Quantify uncertainty and sensitivities in your existing computational models with the “monaco” library. Users define input variables randomly drawn from any of SciPy's statistical distributions, run their model in parallel anywhere from 1 to millions of times, and postprocess the outputs to obtain meaningful, statistically significant conclusions. This talk goes over why you should always be running Monte Carlo simulations, a demo of how to set up and run a sim, and a crash course in generating relevant plots and statistics.",
      "zenodo_url": "https://zenodo.org/record/6946859",
      "slide_id": "monaco_monte_carlo",
      "doi": "10.25080/majora-212e5952-03b"
    },
    {
      "title": "UFuncs and DTypes: new possibilities in NumPy",
      "authors": [
        {
          "name": "Sebastian Berg",
          "affiliation": "BIDS, UC Berkeley",
          "orcid": "0000-0002-1236-259X"
        },
        {
          "name": "Stéfan van der Walt",
          "affiliation": "BIDS, UC Berkeley",
          "orcid": "0000-0001-9276-1891"
        }
      ],
      "description": "Over the past three years, NumPy has seen large changes to much of its core functionalities including universal functions, casting, and DTypes. The goal of this refactoring was to introduce extensible APIs to improve existing user-defined DTypes and unlock new ones. This refactoring is nearing its conclusion, with the work being surfaced as public-facing API. In this talk we will discuss what has been done, and newly possible applications—such as a custom NumPy DType that is aware of physical units.",
      "zenodo_url": "https://zenodo.org/record/6946863",
      "slide_id": "numpy",
      "doi": "10.25080/majora-212e5952-03c"
    },
    {
      "title": "Per Python ad astra: interactive Astrodynamics with poliastro",
      "authors": [
        {
          "name": "Juan Luis Cano Rodríguez",
          "affiliation": "Unaffiliated",
          "orcid": "https://orcid.org/0000-0002-2187-161X"
        }
      ],
      "description": "This talk presents poliastro, an open-source Python library for interactive Astrodynamics that features an easy-to-use API and tools for quick visualization. poliastro implements core Astrodynamics algorithms and leverages numba and Astropy. During the talk, we will describe the two-layer architecture that allows poliastro to offer an approachable API with good performance, discuss the challenges we faced to validate our code, and comment on the successes and failures of the project in trying to build a rich and diverse community. Source code of poliastro is available at https://github.com/poliastro/poliastro/ and documentation is online at https://docs.poliastro.space/.",
      "zenodo_url": "https://zenodo.org/record/6946871",
      "slide_id": "poliastro",
      "doi": "10.25080/majora-212e5952-03d"
    },
    {
      "title": "pyampute: a Python library for data amputation",
      "authors": [
        {
          "name": "Rianne M Schouten",
          "affiliation": "Eindhoven University of Technology",
          "orcid": "0000-0001-5026-4256"
        },
        {
          "name": "Davina Zamanzadeh",
          "affiliation": "University of California, Los Angeles",
          "orcid": "0000-0002-9360-0069"
        },
        {
          "name": "Prabhant Singh",
          "affiliation": "Eindhoven University of Technology",
          "orcid": "0000-0001-7634-2312"
        }
      ],
      "description": "Amputation is the opposite of imputation; it is the creation of a missing data mask for complete datasets. Amputation is useful for evaluating the effect of missing values on the outcome of a statistical or machine learning model. In this talk, we present pyampute: the first open-source Python library for data amputation. Our package is compatible with the scikit-learn-style fit and transform paradigm, which allows for seamless integration of amputation in a larger, more complex data processing pipeline.",
      "zenodo_url": "https://zenodo.org/record/6946887",
      "slide_id": "pyampute",
      "doi": "10.25080/majora-212e5952-03e"
    },
    {
      "title": "Scientific Python: From GitHub to TikTok",
      "authors": [
        {
          "name": "Juanita Gomez Romero",
          "affiliation": "University of California, Santa Cruz",
          "orcid": "0000-0003-1593-3404"
        },
        {
          "name": "Stéfan van der Walt",
          "affiliation": "BIDS, UC Berkeley",
          "orcid": "0000-0001-9276-1891"
        },
        {
          "name": "K. Jarrod Millman",
          "affiliation": "University of California, Berkeley",
          "orcid": "0000-0002-5263-5070"
        },
        {
          "name": "Melissa Weber Mendonça",
          "affiliation": "Quansight",
          "orcid": "0000-0002-3212-402X"
        },
        {
          "name": "Inessa Pawson",
          "affiliation": "Albus Code",
          "orcid": "0000-0001-7294-122X"
        }
      ],
      "description": "The Scientific Python project aims to better coordinate the ecosystem and grow the community. This talk focuses on our efforts to expand our community by generating a welcoming and friendly environment where people collaborate, build, and improve together.",
      "zenodo_url": "https://zenodo.org/record/6946897",
      "slide_id": "scientific-python-community",
      "doi": "10.25080/majora-212e5952-03f"
    },
    {
      "title": "Scientific Python: By maintainers, for maintainers",
      "authors": [
        {
          "name": "Pamphile T. Roy",
          "affiliation": "Quansight",
          "orcid": "0000-0001-9816-1416"
        },
        {
          "name": "Stéfan van der Walt",
          "affiliation": "BIDS, UC Berkeley",
          "orcid": "0000-0001-9276-1891"
        },
        {
          "name": "K. Jarrod Millman",
          "affiliation": "University of California, Berkeley",
          "orcid": "0000-0002-5263-5070"
        },
        {
          "name": "Melissa Weber Mendonça",
          "affiliation": "Quansight",
          "orcid": "0000-0002-3212-402X"
        }
      ],
      "description": "Tools for maintainers and how we can help each others.",
      "zenodo_url": "https://zenodo.org/record/6946917",
      "slide_id": "scientific_python",
      "doi": "10.25080/majora-212e5952-040"
    },
    {
      "title": "Improving random sampling in Python: scipy.stats.sampling and scipy.stats.qmc",
      "authors": [
        {
          "name": "Pamphile T. Roy",
          "affiliation": "Quansight",
          "orcid": "0000-0001-9816-1416"
        },
        {
          "name": "Matt Haberland",
          "affiliation": "BioResource and Agricultural Engineering Department",
          "orcid": "0000-0003-4806-3601"
        },
        {
          "name": "Christoph Baumgarten",
          "affiliation": "Unaffiliated",
          "orcid": "0000-0002-1168-3359"
        },
        {
          "name": "Tirth Patel",
          "affiliation": "Quansight"
        }
      ],
      "description": "Why and how to use scipy.stats.sampling and scipy.stats.qmc?",
      "zenodo_url": "https://zenodo.org/record/6946927",
      "slide_id": "scipy",
      "doi": "10.25080/majora-212e5952-041"
    },
    {
      "title": "Petabyte-scale ocean data analytics on staggered grids via the grid ufunc protocol in xGCM",
      "authors": [
        {
          "name": "Thomas Nicholas",
          "affiliation": "Columbia University",
          "orcid": "0000-0002-2176-0530"
        },
        {
          "name": "Julius Busecke",
          "affiliation": "Columbia University",
          "orcid": "0000-0001-8571-865X"
        },
        {
          "name": "Ryan Abernathey",
          "affiliation": "Columbia University",
          "orcid": "0000-0001-5999-4917"
        }
      ],
      "description": "We analysed the highest resolution global ocean simulation to date, using xGCM, xhistogram, and dask.",
      "zenodo_url": "https://zenodo.org/record/6946933",
      "slide_id": "tom-nicholas",
      "doi": "10.25080/majora-212e5952-042"
    }
  ],
  "tools": [
    {
      "title": "SciPy Tools Plenary - CEL team",
      "authors": [
        {
          "name": "Inessa Pawson",
          "affiliation": "NumFOCUS",
          "orcid": "0000-0001-7294-122X"
        }
      ],
      "description": "Introducing the Contributor Experience Lead team at the SciPy 2022",
      "zenodo_url": "https://zenodo.org/record/6947063",
      "slide_id": "cel-team",
      "doi": "10.25080/majora-212e5952-043"
    },
    {
      "title": "SciPy Tools Plenary on Matplotlib",
      "authors": [
        {
          "name": "Elliott Sales de Andrade",
          "affiliation": "Matplotlib",
          "orcid": "0000-0001-7310-8942"
        }
      ],
      "description": "Matplotlib is a comprehensive library for creating static, animated, and interactive visualizations in Python. This presentation summarizes changes over the past year, new features, and future plans.",
      "zenodo_url": "https://zenodo.org/record/6946953",
      "slide_id": "matplotlib",
      "doi": "10.25080/majora-212e5952-044"
    },
    {
      "title": "SciPy Tools Plenary - NumPy",
      "authors": [
        {
          "name": "Inessa Pawson",
          "affiliation": "NumFOCUS",
          "orcid": "0000-0001-7294-122X"
        }
      ],
      "description": "Annual update on the NumPy project at SciPy 2022",
      "zenodo_url": "https://zenodo.org/record/6946961",
      "slide_id": "numpy",
      "doi": "10.25080/majora-212e5952-045"
    }
  ]
}
