{
    "authors": [
        {
            "name": "Wanlin Li",
            "affiliation": "Department of Computer Science, University of Sherbrooke, Sherbrooke, QC J1K2R1, Canada"
        },
        {
            "name": "Aleksandr Koshkarov",
            "affiliation": "Department of Computer Science, University of Sherbrooke, Sherbrooke, QC J1K2R1, Canada"
        },
        {
            "name": "My-Linh Luu",
            "affiliation": "Department of Computer Science, University of Quebec at Montreal, Montreal, QC, Canada"
        },
        {
            "name": "Nadia Tahiri",
            "affiliation": "Department of Computer Science, University of Sherbrooke, Sherbrooke, QC J1K2R1, Canada"
        }
    ],
    "title": "Phylogeography: Analysis of genetic and climatic data of SARS-CoV-2",
    "description": "Due to the fact that the SARS-CoV-2 pandemic reaches its peak, researchers around the globe are combining efforts to investigate the genetics of different variants to better deal with its distribution. This paper discusses phylogeographic approaches to examine how patterns of divergence within SARS-CoV-2 coincide with geographic features, such as climatic features. First, we propose a python-based bioinformatic pipeline called **aPhylogeo** for phylogeographic analysis written in Python 3 that help researchers better understand the distribution of the virus in specific regions via a configuration file, and then run all the analysis operations in a single run. In particular, the aPhylogeo tool determines which parts of the genetic sequence undergo a high mutation rate depending on geographic conditions, using a sliding window that moves along the genetic sequence alignment in user-defined steps and a window size. As a Python-based cross-platform program, aPhylogeo works on Windows®, MacOS X® and GNU/Linux. The implementation of this pipeline is publicly available on GitHub (https://github.com/tahiri-lab/aPhylogeo). Second, we present an example of analysis of our new aPhylogeo tool on real data (SARS-CoV-2) to understand the occurrence of different variants.",
    "zenodo_url": "https://zenodo.org/record/6946742"
}
